In [15]:
import pandas as pd
import numpy as np
import pymssql
import mysql.connector
from sqlalchemy import create_engine

In [20]:
pd.set_option('display.width', 75)
pd.set_option('display.max_columns', None)
pd.options.display.float_format = '{:,.2f}'.format

In [11]:
# set sql select statement to pull the data
sqlselect = "SELECT studentid, school, sex, age, famsize,\
  medu AS mothereducation, fedu AS fathereducation,\
  traveltime, studytime, failures, famrel, freetime,\
  goout, g1 AS gradeperiod1, g2 AS gradeperiod2,\
  g3 AS gradeperiod3 From studentmath"

In [12]:
# use the pymssql api and read_sql to retrieve and load data from a SQL Server instance
server = "pdcc.c9sqqzd5fulv.us-west-2.rds.amazonaws.com"
user = "pdccuser"
password = "pdccpass"
database = "pdcctest"

In [14]:
conn = pymssql.connect(server=server,
  user=user, password=password, database=database)
studentmath = pd.read_sql(sqlselect,conn)
conn.close()

C:\Users\user\AppData\Local\Temp\ipykernel_14304\4149243782.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  studentmath = pd.read_sql(sqlselect,conn)

In [16]:
studentmath.dtypes

studentid          object
school             object
sex                object
age                 int64
famsize            object
mothereducation     int64
fathereducation     int64
traveltime          int64
studytime           int64
failures            int64
famrel              int64
freetime            int64
goout               int64
gradeperiod1        int64
gradeperiod2        int64
gradeperiod3        int64
dtype: object

In [22]:
studentmath.head()

,studentid,school,sex,age,famsize,mothereducation,fathereducation,traveltime,studytime,failures,famrel,freetime,goout,gradeperiod1,gradeperiod2,gradeperiod3
0,001,GP,F,18,GT3,4,4,2,2,0,4,3,4,5,6,6
1,002,GP,F,17,GT3,1,1,1,2,0,5,3,3,5,5,6
2,003,GP,F,15,LE3,1,1,1,2,3,4,3,2,7,8,10
3,004,GP,F,15,GT3,4,2,1,3,0,3,2,2,15,14,15
4,005,GP,F,16,GT3,3,3,1,2,0,4,3,2,6,10,10

In [ ]:
# Connecting to a MySQL server.

In [13]:
host = "pdccmysql.c9sqqzd5fulv.us-west-2.rds.amazonaws.com"
user = "pdccuser"
password = "pdccpass"
database = "pdccschema"
connmysql = mysql.connector.connect(host=host,\
  database=database,user=user,password=password)
studentmath = pd.read_sql(sqlselect,connmysql)
connmysql.close()

C:\Users\user\AppData\Local\Temp\ipykernel_12236\3853804673.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  studentmath = pd.read_sql(sqlselect,connmysql)

In [17]:
# Using SQLAlchemy

In [19]:
# Define the connection string
host = "pdccmysql.c9sqqzd5fulv.us-west-2.rds.amazonaws.com"
user = "pdccuser"
password = "pdccpass"
database = "pdccschema"

# Create the SQLAlchemy engine
engine = create_engine(f'mysql+pymysql://{user}:{password}@{host}/{database}')

# Use the engine to execute the query and load data into a DataFrame
sqlselect = "SELECT studentid, school, sex, age, famsize,\
  medu AS mothereducation, fedu AS fathereducation,\
  traveltime, studytime, failures, famrel, freetime,\
  goout, g1 AS gradeperiod1, g2 AS gradeperiod2,\
  g3 AS gradeperiod3 From studentmath"
with engine.connect() as conn:
    studentmath = pd.read_sql(sqlselect, conn)

# DataFrame is now ready
print(studentmath)

    studentid school sex  age famsize  mothereducation  fathereducation  \
0         001     GP   F   18     GT3                4                4
1         002     GP   F   17     GT3                1                1
2         003     GP   F   15     LE3                1                1
3         004     GP   F   15     GT3                4                2
4         005     GP   F   16     GT3                3                3
..        ...    ...  ..  ...     ...              ...              ...
390       391     MS   M   20     LE3                2                2
391       392     MS   M   17     LE3                3                1
392       393     MS   M   21     GT3                1                1
393       394     MS   M   18     LE3                3                2
394       395     MS   M   19     LE3                1                1

     traveltime  studytime  failures  famrel  freetime  goout  gradeperiod1  \
0             2          2         0       4         3      4             5
1             1          2         0       5         3      3             5
2             1          2         3       4         3      2             7
3             1          3         0       3         2      2            15
4             1          2         0       4         3      2             6
..          ...        ...       ...     ...       ...    ...           ...
390           1          2         2       5         5      4             9
391           2          1         0       2         4      5            14
392           1          1         3       5         5      3            10
393           3          1         0       4         4      1            11
394           1          1         0       3         2      3             8

     gradeperiod2  gradeperiod3
0               6             6
1               5             6
2               8            10
3              14            15
4              10            10
..            ...           ...
390             9             9
391            16            16
392             8             7
393            12            10
394             9             9

[395 rows x 16 columns]

In [23]:
# rearrange columns and set an index
newcolorder = ['studentid', 'gradeperiod1',
  'gradeperiod2','gradeperiod3', 'school', 
  'sex', 'age', 'famsize','mothereducation',
  'fathereducation', 'traveltime',
  'studytime', 'freetime', 'failures',
  'famrel','goout']

In [25]:
studentmath = studentmath[newcolorder]
studentmath.studentid.count()

395